const app = require('express')();

app.get('/', (req, res ) => 
    res.json({ message: 'চট্টগ্রাম 🌊🚢: বাংলাদেশের দক্ষিণ-পূর্বাঞ্চলে অবস্থিত, \nএই বন্দর শহর 🏙️ তার প্রাচীন ইতিহাস, প্রাকৃতিক সৌন্দর্য 🌿, \nএবং জীবন্ত বাণিজ্যিক কেন্দ্র হিসেবে পরিচিত। পাহাড়, সমুদ্র 🏖️, \nএবং সবুজায় ঘেরা, এটি পর্যটকদের মাঝে জনপ্রিয়। \nচট্টগ্রামের বন্দর 🚢 বাংলাদেশের প্রধান বাণিজ্যিক বন্দর এবং এশিয়ার অন্যতম ব্যস্ত বন্দর।' }) 
);

const port = process.env.PORT || 8080;

app.listen(port, () => console.log(`app listening on http://localhost:${port}`) );